app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]
---
					<%= link_to book_favorites_path(book),class:"glyphicon glyphicon-heart", method: :delete do %>
						<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
					<%= link_to book_favorites_path(book), class:"glyphicon glyphicon-heart-empty", method: :post do %>
						<%= book.favorites.count %>

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
---
					<% end %>
					<td>コメント数:<%= book.book_comments.count %></td>