app/views/books/show.html.erb

					<%= link_to book_favorites_path(@books),class:"glyphicon glyphicon-heart", method: :delete do %>
						<%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

					<%= link_to book_favorites_path(@books), class:"glyphicon glyphicon-heart-empty", method: :post do %>
						<%= @books.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 3]]

					<% end %>
					<td>コメント数:<%= @books.book_comments.count %></td>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]

			</table>
			<% @books.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 3]]