app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @books = Book.find(params[:id])

SELECT "books".* FROM "books"
---
  def index
    @user = current_user
    @books = Book.all

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ここお"], ["body", "っっkw"], ["user_id", 2], ["created_at", "2020-08-24 06:27:53.999154"], ["updated_at", "2020-08-24 06:27:53.999154"]]
SELECT "books".* FROM "books"
---
  def create

    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id), notice: "You have created book successfully."
    else
      @books = Book.all