app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "そそそおっそ"], ["user_id", 2], ["book_id", 3], ["created_at", "2020-08-24 06:18:03.658149"], ["updated_at", "2020-08-24 06:18:03.658149"]]
---
    def create
        book = Book.find(params[:book_id])
        comment = current_user.book_comment.new(post_comment_params)
        comment.book_id = book.id
        comment.save